examples/01_LIGGGHTSVerificationTests/ii_tangentialForceTest/openHFDIB-DEM/inclineAngle-30deg/constant/HFDIBDEMDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      HFDIBDEMDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

bodyNames ("sphere" );

interpolationSchemes
{
  U cell;
}

surfaceThreshold    1e-4;
stepDEM     1e-4;
geometricD (1 1 1);
recordSimulation true;
recordFirstTimeStep true;

outputSetup
{
    basic true;
    iB  true;
    DEM true;
    addModel false;
    parallelDEM true;
}
DEM
{
    materials
    {
        particle
        {
            Y       1e8;
            nu      0.0;
            gamma   0.0;
            mu      1;
            adhN    0;
			eps	 	0.9;
        }
        
        wall
        {
            Y       1e8;
            nu      0.0;
            gamma   0.0;
            mu      1;
            adhN    0;
			eps	 	0.9;
        }
    }
    LcCoeff 0.55;
    collisionPatches
    {
		wall
		{
			material wall;
			nVec (0.0 -1.0 0.0);
			planePoint (0.0 0.0 0.0);
		}
    }

}

sphere
{
	fullyCoupledBody;
	rho         rho [1 -3 0 0 0 0 0] 2500;
	refineMC 5;
	U
	{
		BC  noSlip;
	}
	bodyAddition
	{
		addModel   once;
		onceCoeffs{}

	}	
	material particle;
	bodyGeom sphere;
	sphere
	{
		radius 0.04;
		startPosition (0 0.04 0);
	}
	updateTorque true;
	sdBasedLambda false;
	interfaceSpan 1.0;
	startSynced false;
	refineBuffers 2;
	timesToSetStatic -1;	
}
// ************************************************************************* //

